{
  "url": "https://itunes.apple.com/search?term=jack+johnson",
  "response": {
    "resultCount": 2,
    "results": [
      {
        "wrapperType": "track",
        "kind": "feature-movie",
        "artistId": 909253,
        "trackId": 1467927519,
        "artistName": "Jack Johnson",
        "trackName": "En Concert",
        "trackCensoredName": "En Concert",
        "artistViewUrl": "https://music.apple.com/us/artist/jack-johnson/909253?uo=4",
        "trackViewUrl": "https://itunes.apple.com/us/movie/en-concert/id1467927519?uo=4",
        "previewUrl": "https://video-ssl.itunes.apple.com/itunes-assets/Video128/v4/be/ef/af/beefaffe-6278-4336-07a1-de180ddaeaf8/mzvf_1177979557611386379.640x468.h264lc.U.p.m4v",
        "artworkUrl30": "https://is1-ssl.mzstatic.com/image/thumb/Video/8b/ea/6c/mzi.gnjahvkg.jpg/30x30bb.jpg",
        "artworkUrl60": "https://is1-ssl.mzstatic.com/image/thumb/Video/8b/ea/6c/mzi.gnjahvkg.jpg/60x60bb.jpg",
        "artworkUrl100": "https://is1-ssl.mzstatic.com/image/thumb/Video/8b/ea/6c/mzi.gnjahvkg.jpg/100x100bb.jpg",
        "collectionPrice": 12.99,
        "trackPrice": 12.99,
        "releaseDate": "2009-01-01T08:00:00Z",
        "collectionExplicitness": "notExplicit",
        "trackExplicitness": "notExplicit",
        "trackTimeMillis": 4773648,
        "country": "USA",
        "currency": "USD",
        "primaryGenreName": "Concert Films",
        "contentAdvisoryRating": "Unrated",
        "shortDescription": "Jack Johnson:: En Concert",
        "longDescription": "Jack Johnson:: En ConcertA Live Film and Album.Words by Emmett Malloy (filmmaker)I began making films about 10 years ago with Jack. We became good friends right away, and seemed to be into the same sort of films, but both ofus did not know a whole lot about the process. So we started with what we knew bestmaking surf films. We made a couple of films together,and it wasnt long before Jack figured out making music was his real calling. So I lost my favorite cinematographer in Jack, but gained a newfavorite musician.Now several years later, I have been lucky enough to be able to document the last decade of Jacks music career. This past summer, a coupleof friends and I went to Europe with Jack and his band for a tour supporting his last record, Sleep Through the Static. We brought a couple ofcameras and microphones because it seemed like a great tour to capture. Jack Johnson::En Concert was the result of that decision.There was a point in the middle of the European tour where I was on stage behind Jack as he sang one of his most intimate love songs, BetterTogether. Looking through my lens I focused in on Jack standing alone in front of 20,000 fans. Lighters and cell phones lit up the crowd, illuminatingmost all of the audience that was singing along. It was the biggest backup vocal section I had ever witnessed, and it looked and soundedbeautiful. As I focused my camera on the crowd, I began to see all the details of the fans. What went through my head was that we were in Paris,France, and suddenly the language barrier had no restrictions. Everyone knew the translation for Jacks simple message, that its so much betterwhen were together.This connection with the fans continued to happen in every country we traveled to around the world. These simple messages and testaments oflove and family are what make Jacks music so popular around the globe. As the filmmaker I really enjoyed being able to document the honestrelationship between an artist and his fans. No matter where we were in the world that year, it was clear that everyone understood and believedin what Jack was singing about.Jack Johnson:: En Concert is a documentation of Jack and his band playing some of the most historic venues throughout Europe, and everythinginteresting they did in between shows.Jack really does not like to be on the other side of the lens. Getting a shot of him is kind of similar to getting a shot of the Loch Ness Monster;its a rare occurrence. Surprisingly, he let our cameras really join him on this tour. I just knew that I better keep a guitar or surfboard in hishands, because with either of those weapons he seemed to never know we were there.Enjoy the film.Emmett MalloyJACK JOHNSONEN CONCERT"
      },
      {
        "wrapperType": "track",
        "kind": "feature-movie",
        "trackId": 1598946657,
        "artistName": "Robert Mugge",
        "trackName": "Deep Blues",
        "trackCensoredName": "Deep Blues",
        "trackViewUrl": "https://itunes.apple.com/us/movie/deep-blues/id1598946657?uo=4",
        "previewUrl": "https://video-ssl.itunes.apple.com/itunes-assets/Video116/v4/6a/e1/a2/6ae1a2a3-28a5-8e55-775a-5b74507e6581/mzvf_14820757366592683783.640x480.h264lc.U.p.m4v",
        "artworkUrl30": "https://is1-ssl.mzstatic.com/image/thumb/Video116/v4/e3/20/63/e320632c-0d66-3e9f-fc83-5865fd4c2718/FilmMovement_DeepBlues_Poster.jpg/30x30bb.jpg",
        "artworkUrl60": "https://is1-ssl.mzstatic.com/image/thumb/Video116/v4/e3/20/63/e320632c-0d66-3e9f-fc83-5865fd4c2718/FilmMovement_DeepBlues_Poster.jpg/60x60bb.jpg",
        "artworkUrl100": "https://is1-ssl.mzstatic.com/image/thumb/Video116/v4/e3/20/63/e320632c-0d66-3e9f-fc83-5865fd4c2718/FilmMovement_DeepBlues_Poster.jpg/100x100bb.jpg",
        "collectionPrice": 9.99,
        "trackPrice": 9.99,
        "trackRentalPrice": 3.99,
        "collectionHdPrice": 12.99,
        "trackHdPrice": 12.99,
        "trackHdRentalPrice": 3.99,
        "releaseDate": "2021-10-13T07:00:00Z",
        "collectionExplicitness": "notExplicit",
        "trackExplicitness": "notExplicit",
        "trackTimeMillis": 5484620,
        "country": "USA",
        "currency": "USD",
        "primaryGenreName": "Music Documentaries",
        "contentAdvisoryRating": "Unrated",
        "shortDescription": "In 1990, commissioned by Dave Stewart of Eurythmics, veteran music film director Robert Mugge and",
        "longDescription": "In 1990, commissioned by Dave Stewart of Eurythmics, veteran music film director Robert Mugge and renowned music scholar Robert Palmer ventured deep into the heart of the North Mississippi Hill Country and Mississippi Delta to seek out the best rural blues acts currently working. Starting on Beale Street in Memphis, they headed south to the juke joints, lounges, front porches, and parlors of Holly Springs, Greenville, Clarksdale, Bentonia, and Lexington. Along the way, they visited celebrated landmarks and documented talented artists cut off from the mainstream of the recording industry. The resulting film expresses reverence for the rich musical history of the region, spotlighting local performers, soon to be world-renowned, thanks in large part to the film, and demonstrating how the blues continues to thrive in new generations of gifted musicians."
      }
    ]
  }
}
